app/controllers/visits_controller.rb

INSERT INTO "visits" ("name", "created_at", "updated_at", "phone", "yelp_id", "count") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "The Bread Basket"], ["created_at", 2016-11-02 14:27:19 UTC], ["updated_at", 2016-11-02 14:27:19 UTC], ["phone", "3074322525"], ["yelp_id", "the-bread-basket-cheyenne"], ["count", 1]]
UPDATE "visits" SET "count" = COALESCE("count", 0) + 1 WHERE "visits"."id" = $1  [["id", 1]]
---
  def create
    @visit = Visit.find_or_create_by(visit_params)
    @visit.increment!(:count,1)